<template><div><p>猎米云商 - 微信小程序 / H5 / 管理后台
公司内部电商系列产品，主导负责web部分的开发，包括微信小程序以及H5端。使用vue全家桶，整合公司原有的小程序资源，选用微信官方开发的跨端框架kbone，同时维护输出两端。经手开发了基础电商模块、可配置的首页模块、营销模块（包括拼团，秒杀，预售）、直播模块、S2B2C模块、B2B2C模块、O2O模块等。重构项目内配置，将多个模块的配置信息抽离为公共文件，编写若干脚本用于打包以及发布。利用LESS抽离项目的配色文件用于实现换肤功能。
管理后台部分，选用vue-element-admin框架编写与前端配套的管理后台。引入echarts，封装数据处理函数，编写后台的数据可视化统计模块。引入网易云信，使用网易云信的IM SDK，开发点对点的客服系统。</p>
<p>工作经历</p>
<p>2019.07-2019.09
嗨不停电商小程序</p>
<p>2019.10-2019.12
钱王来了 在线教育小程序</p>
<p>2020</p>
<p>2020.02-2020.09
云商项目<br>
负责H5和小程序的编写，重构了整个项目结构，引入了微信官方开放的跨端框架kbone，实现
抽离公共样式文件
抽离配置文件
重新封装请求函数 推入队列 操作
编写自动化部署脚本</p>
</div></template>


